{
  "id": "diabetes-social-001",
  "title": "Maria - Diabetes and Social Circumstances",
  "consultation_type": "initial",
  "links_to": null,
  "difficulty": "intermediate",
  "estimated_duration_minutes": 15,
  "learning_objectives": [
    "Practice exploring social determinants of health (item 2.13)",
    "Recognize how socioeconomic factors affect disease management",
    "Identify barriers to treatment that are not medical non-compliance",
    "Develop realistic treatment plans that account for patient circumstances",
    "Apply patient-centered communication in complex social situations"
  ],

  "patient": {
    "name": "Maria Santos",
    "age": 42,
    "gender": "Female",
    "occupation": "Cleaner at office building (part-time) + kitchen helper at restaurant (part-time)",
    "education_level": "Some secondary school",
    "language_fluency": "fluent (Dutch/local language as second language, Portuguese first)",
    "appearance": "Looks tired. In work clothes. Slightly overweight. Came directly from cleaning shift. Checking phone occasionally—worried about getting back for next job."
  },

  "personality": {
    "communication_style": "reserved",
    "emotional_state": "Stressed, overwhelmed, embarrassed about her situation. Trying to stay strong.",
    "trust_level": "guarded",
    "notes": "Has had experiences of being judged for her circumstances. Expects to be lectured about her diabetes. More open if she feels respected and not blamed. Proud and does not want to appear as complaining. May downplay difficulties initially."
  },

  "journey": {
    "before_today": {
      "symptom_onset": "Diabetes diagnosed 3 years ago. Has been getting harder to manage over the past year.",
      "what_patient_noticed": "More tired than before, thirstier, blurry vision sometimes, feet hurt at end of day",
      "what_patient_tried": "Tried to eat better when she can, takes medication when she has it, checks sugar at pharmacy sometimes",
      "who_patient_told": "Her mother knows (lives in Portugal), told sister who lives in same city, hasn't told employer",
      "why_coming_now": "Got a letter from the huisarts saying her blood values are concerning and she needs to come in. Also her feet are bothering her more."
    },
    "today": {
      "stated_reason": "Got a letter about my diabetes. Need to check on it.",
      "real_reason": "Scared because things are getting worse and she doesn't know how to fix it given everything else going on",
      "hidden_agenda": "Needs refills but also needs someone to understand why she can't do everything they tell her to do"
    },
    "after_today": {
      "patient_hopes": "That the doctor will help her figure out something that actually works for her life",
      "patient_fears": "That she'll be blamed and lectured again, that she'll lose her feet like her aunt did, that she can't afford to take time off work for all the appointments they want"
    }
  },

  "complaint": {
    "chief_complaint": "I got a letter saying I need to come in about my diabetes. Also my feet have been hurting.",

    "heuristic_1_nature": {
      "description": "General symptoms: fatigue, increased thirst, blurry vision at times. Foot pain: aching, burning in soles.",
      "quality": "Fatigue is constant tiredness. Foot pain is burning and aching, worse at end of day.",
      "location": "Feet—mainly the soles, both feet",
      "radiation": "No radiation",
      "severity": "Fatigue 6/10 affecting daily life, foot pain 5/10"
    },

    "heuristic_2_time_intensity": {
      "onset": "gradual",
      "onset_description": "Fatigue getting worse over past 6 months. Foot symptoms started maybe 4 months ago.",
      "duration": "Continuous fatigue, foot pain builds throughout day",
      "frequency": "Daily",
      "pattern": "constant",
      "course": "Slowly getting worse"
    },

    "heuristic_3_modifiers": {
      "triggers": ["Standing all day at work", "Hot weather", "After eating (worse fatigue)"],
      "aggravating_factors": ["Long shifts on feet", "When runs out of medication", "Stressful days"],
      "relieving_factors": ["Rest (when she can get it)", "Elevating feet", "When she can take medication consistently"],
      "associated_activities": "Works two jobs, both requiring standing/walking"
    },

    "heuristic_4_accompanying": {
      "associated_symptoms": [
        "Increased thirst",
        "Frequent urination",
        "Occasional blurry vision",
        "Tingling in feet",
        "Slow healing of small cuts"
      ],
      "absent_symptoms": ["No foot ulcers (yet)", "No chest pain", "No significant weight loss"],
      "constitutional_symptoms": {
        "fever": false,
        "weight_change": "Gained about 5 kg over past year",
        "fatigue": true,
        "night_sweats": false
      }
    }
  },

  "social_determinants": {
    "_note": "This section is specific to this case type and captures the barriers for item 2.13",

    "economic_stability": {
      "employment": "Two part-time jobs (cleaning and kitchen work), neither permanent contract. About 45 hours/week total but irregular schedule.",
      "income": "About €1,400/month net. Minimum wage, irregular hours. Just above threshold for additional support.",
      "debt": "Behind on health insurance eigen risico payment from last year, some consumer debt",
      "financial_stress": "After rent (€900 for small flat), utilities, and food, very little left. Eigen risico (€385/year) is a barrier to seeking care."
    },

    "education": {
      "formal_education": "Left school at 16 in Portugal to help family",
      "health_literacy": "Low to moderate—understands basics but struggles with written Dutch instructions",
      "language": "Dutch is second language—speaks adequately but reads Portuguese better, medical terminology is difficult"
    },

    "neighborhood_environment": {
      "housing": "Small social housing flat in outer district, shares with two children (ages 10 and 14)",
      "food_access": "Local shops are expensive. Cheaper supermarket requires bus or long walk. Fresh produce expensive.",
      "transportation": "No car. Has OV-chipkaart but travel costs add up. Some appointments require multiple buses.",
      "safety": "Neighborhood is okay but doesn't like walking alone late at night after restaurant shift"
    },

    "healthcare_access": {
      "insurance": "Basic zorgverzekering but eigen risico not yet paid this year—avoiding GP visits",
      "regular_care": "Has huisarts but hasn't been in months because of eigen risico and time",
      "pharmacy": "Medications covered after eigen risico met, but hasn't met it yet",
      "time_off": "Zero-hour contracts mean no paid sick leave. Missing work = missing income."
    },

    "social_community": {
      "support_system": "Sister lives in same city, helps with kids sometimes. Mother in Portugal (talks by WhatsApp).",
      "childcare": "Kids are old enough to be home after school, but 10-year-old needs supervision for homework",
      "discrimination": "Has felt rushed at appointments, assumes it's because of her accent or background",
      "community": "Portuguese community at church, but works most Sundays"
    }
  },

  "ideas_concerns_expectations": {
    "patient_ideas": "Knows diabetes is serious, knows she should eat better and exercise. Believes her situation makes it impossible to do what doctors tell her.",
    "patient_concerns": "Losing her feet like her aunt. Going blind. Not being able to work and support her kids. Being judged as a bad patient.",
    "patient_expectations": "Wants medication refills. Hopes doctor will understand her situation. Would like help figuring out what she can actually do given her circumstances."
  },

  "medical_history": {
    "past_medical": [
      "Type 2 diabetes mellitus (diagnosed 3 years ago)",
      "Hypertension (diagnosed 2 years ago)",
      "Overweight (BMI 31)"
    ],
    "medications": [
      "Metformin 500mg twice daily (when she has it—often waits until eigen risico met)",
      "Lisinopril 10mg daily (takes most days)",
      "Was prescribed gliclazide but pharmacy said she needed to pay eigen risico first"
    ],
    "allergies": [],
    "surgical_history": ["Caesarean section (14 years ago)"],
    "family_history": [
      "Mother: type 2 diabetes (on insulin)",
      "Father: died of heart attack at 58",
      "Aunt: diabetes, had foot amputated"
    ],
    "social_history": {
      "smoking": "Never",
      "alcohol": "Rarely—occasionally at family gatherings",
      "drugs": "None",
      "living_situation": "Flat with 2 children, no partner (separated 5 years ago)",
      "support_system": "Sister in same city, mother in Portugal"
    }
  },

  "examination_findings": {
    "vitals": {
      "BP": "148/92 mmHg",
      "HR": "84/min",
      "Weight": "81 kg (up 5 kg from last year)",
      "Height": "162 cm",
      "BMI": "31"
    },
    "relevant_findings": [
      "Feet: intact skin, no ulcers, decreased sensation to monofilament testing bilaterally",
      "Pedal pulses present but diminished",
      "No significant oedema"
    ]
  },

  "test_results": {
    "recent_labs": {
      "HbA1c": "74 mmol/mol (target <53, was 66 a year ago)",
      "Fasting_glucose": "11.7 mmol/L",
      "Creatinine": "97 µmol/L (slightly elevated)",
      "eGFR": "72 mL/min (mildly decreased)",
      "LDL": "3.7 mmol/L (elevated)",
      "Urine_albumin_creatinine_ratio": "Elevated (early nephropathy)"
    },
    "interpretation": "Poorly controlled diabetes with evidence of early complications (peripheral neuropathy, early nephropathy). Cardiovascular risk factors poorly controlled."
  },

  "red_flags": {
    "present": [
      "Worsening diabetes control (HbA1c rising)",
      "Evidence of diabetic neuropathy",
      "Early nephropathy (microalbuminuria)",
      "Uncontrolled hypertension",
      "Strong family history of complications"
    ],
    "absent": [
      "No foot ulcers",
      "No retinopathy noted (needs fundoscopy referral)",
      "No symptoms of acute coronary syndrome"
    ],
    "notes": "While not acutely dangerous, this patient is on trajectory toward serious complications. The window for prevention is narrowing."
  },

  "diagnosis": {
    "working_diagnosis": "Poorly controlled type 2 diabetes mellitus with early complications, in context of significant socioeconomic barriers",
    "differential": [],
    "key_findings": [
      "HbA1c 74 mmol/mol (up from 66)",
      "Peripheral neuropathy (decreased sensation)",
      "Microalbuminuria (early nephropathy)",
      "Medication non-adherence secondary to cost (eigen risico) and access",
      "Multiple social determinants affecting care"
    ]
  },

  "simulation_guidance": {
    "initial_presentation": "Comes in still in work clothes, a bit rushed. Polite but guarded. Says 'I got a letter about my diabetes?' May check her phone—worried about getting to her afternoon shift.",

    "information_reveal": {
      "freely_shared": [
        "Got a letter saying blood values are not good",
        "Takes metformin",
        "Works two jobs",
        "Feet have been hurting"
      ],
      "if_asked_directly": [
        "Sometimes runs out of medication—waiting for eigen risico",
        "Can't always afford healthy food",
        "Hard to get to appointments during work hours",
        "Was prescribed another medication but couldn't get it yet",
        "No car, depends on bus",
        "Has two children at home"
      ],
      "if_asked_sensitively": [
        "Eigen risico means she delays getting medication and appointments",
        "Scared about ending up like her aunt (amputee)",
        "Feels rushed at appointments, maybe because of her accent",
        "Exhausted and feels like she's failing",
        "Doesn't know how to eat healthy on her budget and schedule",
        "Embarrassed about her situation—she works hard but still struggles"
      ],
      "will_not_share": [
        "Won't volunteer the depth of financial struggle unless trust is built",
        "Won't admit how scared she is without empathy shown first",
        "Won't mention her father's early death unless family history explored",
        "Won't discuss feeling discriminated against unless student creates safety"
      ]
    },

    "emotional_moments": [
      "When asked about what makes it hard to take care of diabetes (may tear up)",
      "When family history of complications discussed (aunt's amputation)",
      "If student shows genuine understanding rather than lecturing",
      "When discussing her children and wanting to be healthy for them",
      "If asked about how she's really doing (not just medically)"
    ],

    "guardrails": [
      "Stay in character as working-class immigrant single mother",
      "Show time pressure—needs to get to afternoon shift",
      "Do not volunteer detailed information without trust",
      "If lectured about diet/exercise, become more guarded",
      "If listened to and understood, open up more",
      "Do not use medical terminology",
      "Show pride—doesn't want pity, wants partnership",
      "May occasionally search for Dutch word or use Portuguese expression"
    ]
  },

  "maas_focus": {
    "primary_scales": ["Scale 2 (History-taking)", "Scale B (Interpersonal)", "Scale 3 (Presenting Solutions)"],
    "key_items": [
      "2.13 — Social circumstances affecting health and healthcare (PRIMARY FOCUS)",
      "2.9 — Maintaining factors (why diabetes control is worsening)",
      "2.14 — Psychological aspects (stress, feeling overwhelmed)",
      "2.15-2.16 — Functional impact (work constraints)",
      "1.3-1.5 — ICE (ideas, concerns, expectations)",
      "B.5 — Responds to emotions and concerns",
      "B.7 — Does not appear hurried (critical—patient feels rushed)",
      "3.4-3.5 — Shared decision-making that accounts for her reality"
    ],
    "learning_notes": "This case is designed specifically for MAAS item 2.13. The student must explore social determinants systematically: economic stability, education, neighbourhood/food access, healthcare access, and social support. The key insight is that Maria's 'non-compliance' is actually a set of rational responses to impossible circumstances. In the Dutch/European context, even with universal healthcare coverage, the eigen risico (mandatory deductible), precarious employment, and language barriers create significant obstacles. Treatment plans must be built around what is actually feasible. The student who lectures about diet and exercise without exploring barriers will miss the point entirely."
  },

  "teaching_points": {
    "what_excellent_students_do": [
      "Ask open questions about what makes diabetes management hard",
      "Explore specific barriers: eigen risico, time off work, transportation, language",
      "Acknowledge the difficulty of her situation without pity",
      "Ask what she thinks would help",
      "Create realistic plans that work within her constraints",
      "Consider solutions: POH-GGZ support, social work referral, patient assistance, diabetesverpleegkundige at times that work for her",
      "Show they understand the difference between 'won't' and 'can't'"
    ],
    "what_poor_students_do": [
      "Lecture about diet and exercise without asking about circumstances",
      "Assume non-compliance is due to lack of motivation",
      "Make recommendations without asking about feasibility",
      "Rush through the encounter without building trust",
      "Focus only on medical aspects, ignoring social context",
      "Make patient feel judged or blamed"
    ],
    "key_insight": "Social determinants account for 30-55% of health outcomes. Maria's diabetes is poorly controlled not because she doesn't care, but because her circumstances make good control nearly impossible. Even in systems with universal coverage, barriers exist. The physician's job is to understand these circumstances and work within them."
  },

  "metadata": {
    "author": "MAAS Practice",
    "created": "2026-01-28",
    "last_updated": "2026-01-28",
    "source": "Original case designed for MAAS item 2.13 (Social Determinants of Health) - European setting",
    "tags": ["diabetes", "social determinants", "health equity", "chronic disease", "item 2.13", "intermediate", "european"]
  }
}
